function 初始化(属性){
    //初始属性
    属性.setHp(10);
    属性.setHp_max(10);
    属性.setMp(50);
    属性.setMp_max(50);
    属性.setExp(999);
    属性.setExp_max(999);
    属性.setAtk(10);
}

function 对话(client, 窗口, 消息, 目标){
    if (消息.getRole() !=null) {
        if (消息.getRole() != ''){
            eval(消息.getRole()+"(client, 窗口, 消息,目标)");
            return;
        }
    }
    脚本工具.添加选项("你好!", "action", "", 消息.getMsg(), '');
    脚本工具.添加选项("讨伐怪物","action", "doTalk", 消息.getMsg(), "任务1");
    脚本工具.添加选项("对话谷中法师","action", "doTalk", 消息.getMsg(), "任务2");
    窗口.内容("你好啊年轻人");
    窗口.添加选项集合(脚本工具);
    脚本工具.返回元素消息(client,"action","doTalk",null,窗口);
}
//打怪任务
function 任务1(client, 窗口, 消息, gameObj){
    //任务创建部分
    var 任务 =  脚本工具.新建();
    var 奖励 =  背包.新建();
    奖励.给经验(1350);//经验
    奖励.给物品(3, 1);//id 为1的物品给与1个
    任务.任务创建("kill1", "can", null, "击杀两只鹿,我会给你一个礼包");
    任务.任务创建条件(5, 2);//id为1的怪物杀两只
    任务.任务添加条件集("kill");
    var 该任务 =脚本工具.检查任务状态(client, 任务.取任务());//我身上的任务查  看玩家是否接了任务，没有则添加，看是否完成
    if ("finished" == 该任务.取状态()){
        窗口.内容("少侠做的不错！这是给你的奖励");
        脚本工具.添加选项("小事一桩", "action", "doTalk", "", "testTask");
        脚本工具.发送奖励(client, 奖励);
        该任务.置状态("cant");//设置为不可接 以后循环任务可以操作
    }else if("processing" == 该任务.取状态() || "can" == 该任务.取状态()) {
        该任务.置状态("processing");
        窗口.内容(任务.getTask().getDesc() + "\n" + 该任务.取任务详情());
        脚本工具.添加选项("我这就去把他们击溃", "action", "doTalk", "", "testTask");
        
    }else{//已经做完任务
        窗口.内容("少侠快去别的地方探索吧");
        脚本工具.添加选项("谢谢", "action", "doTalk", "", "");
    }
    窗口.添加选项集合(脚本工具);
    窗口.列数(2);
    脚本工具.返回元素消息(client,"action","doTalk",消息.getRole(),窗口);
}
//对话任务
function 任务2(client, 窗口, 消息, gameObj){
    //任务创建部分
    var 任务 = 脚本工具.新建();
    var 奖励 = 背包.新建();
    奖励.给经验(1350);//经验
    奖励.给物品(1, 1);//id 为1的物品给与1个
    任务.任务创建("testtalk", "can", null, "我在村长不便,劳烦少侠替我去找谷中法师 问他是否愿意帮我们击败恶魔！");
    任务.任务创建条件(24, 1);//id为24的npc对话
    任务.任务添加条件集("talk");
    var 该任务 =脚本工具.检查任务状态(client, 任务.取任务());//我身上的任务查  看玩家是否接了任务，没有则添加，看是否完成
    if ("finished" == 该任务.取状态()) {
        窗口.内容("法师的事情算告一段落了");
        脚本工具.添加选项("小事一桩", "action", "doTalk", "", "");
        脚本工具.发送奖励(client, 奖励);
        该任务.置状态("cant");//设置为不可接 以后循环任务可以操作
    }else if("processing" == 该任务.取状态() || "can" == 该任务.取状态()) {
        该任务.置状态("processing");
        窗口.内容(任务.getTask().getDesc() + "\n" + 该任务.取任务详情());
        脚本工具.添加选项("义不容辞", "action", "doTalk", "", "");
    }else{//已经做完任务
        窗口.内容("少侠快去别的地方探索吧");
        脚本工具.添加选项("谢谢", "action", "doTalk", "", "");
    }
    窗口.添加选项集合(脚本工具);
    窗口.列数(2);
    脚本工具.返回元素消息(client,"action","doTalk",消息.getRole(),窗口);
}
